# encoding: utf-8

require "ffaker"

def file_to_array (file)
  File.readlines(file).map { |line| line.delete "\n" }
end

module FFaker
  module Address
    @cities_file   = "us_cities.dat".freeze

    def load_db
      @database = file_to_array @cities_file
    end

    def city_zip_code
      FFaker.numerify @database.sample
    end

    def phone
      phone_number = "+1-%010d" % rand(10**11)
      # phone_number.insert 6, "-"
      # phone_number.insert 10, "-"
    end
  end

  module AddressRU
    @cities_file   = "ru_cities.dat".freeze

    def phone
      phone_number = "+7-%010d" % rand(10**11)
      # phone_number.insert 6, "-"
      # phone_number.insert 10, "-"
    end
  end

  module AddressBY
    include FFaker::Address

    extend ModuleUtils
    extend self

    @cities_file = "by_cities.dat".freeze
    @streets_base = file_to_array "by_streets.dat"
    MAX_STREETS = 42

    def street_address
      "#{@streets_base.sample}, д. #{rand MAX_STREETS}"
    end

    def phone
      phone_number = "+375-%09d" % rand(10**10)
      # phone_number.insert 7, "-"
      # phone_number.insert 11, "-"
    end

  end

  module NameBY
    include FFaker::Name

    extend ModuleUtils
    extend self

    LAST_NAMES = {
        male: %w(Абарун Абішаў Аўсюк Агаянц Адрушчанкаў Азарковiч Айзатуллаў Акуненкаў Алабян Алвердашвiлi Алегiн Аляксандравіч Андолаўскi Анзiмiраў Анісімавіч Анпілаў Арiхiн Артюнаў Асiкайнен Ахагiнскi Ахмедзянаў Ахундзянаў Ачамовiч Ашiрметаў Багнiкян Бадашкаў Баздораў Балабанцаў  Балдiхiн Барчунаў Бахалдiн Бахонаў Безiн Беккерман Белавусаў Бельцаў  Берберян Бернштэйн Бессалаў Бiнаў Бiтлер Благородаў Блазнiн Бойка Бордовкiн Барысаў Борсакаў Брагоўскі Бретнаў Брыжахiн Буженкаў Буртняк Бучнiкаў Васющенкаў Вердiянiн Вiрютiн Волiкаў Волнакаў Втонаў Выдрiч Выпiрайлаў Гайдашаў  Галабцаў  Ганецкі Гарьковец Гасымаў Гбiдераў Гваськаў Геаргадзэ Геркiн Герлiванаў Гiдаспаў Гiлюк Гладырiн Глудман Глуздак Голанджан Головашеч Голынкаў Голянаўскi Гостюшiн Грыбаедаў Грiдасаў Маркоціўшыся Губенскi Давлетiнiн Джiджааў  Дзеярскi Долганаў Долганюк Долгараў  Дробуш Дружiнкiн Дымонт Дышаў Елепскi Енанешнiкаў Яроменка Ефiмоўцаў Загумення Зашбахiдзе Зварыкін Зiманенкаў Зубоедаў Іванковіч Iванкаўскi Іванаў Iвлюшiн Iзбiщаў  Кавiн Казінец Калацкi  Камгатных Камзiн Каракулян Карапай Карнацкi Карпышаў  Картманаў  Каптан Квалiашвiлi Квашыхiн Кендалiаў  Кiрылка Клiмнюк Ключеновiч Кобiдзе Колюкаўскi Коргутаў Корлаў Карабцоў Корсаў Касабокі Круцiлiн  Кузьмін Купецкi Купрын Купцiн Купырiн Хмызнякоў Кухтаў Кушнырь Кылосаў Лабушкiн Лагуткiн Лапатiаў Лашаў Летшаў Лечбiнскi Лiзлаў Ліштван Ловчаў  Ломашаў Лопонос Лотаў Магаметшапiаў  Маёраў Малішэўскі Мамычкiн Манукiан Маракшааў  Марудiн Марульскi Маслаў Маціяс Матюшкiн Машурiк Мядзведзеў Медянскi Мелюшкiн Мендусаў Мерiнсон Мiлаславаў Мiрошнiчаў  Мiрсiянаў Мiтраковiч Міхайлаў Мiхiтарян Міхлін Мiльцын Мiцiн Мокроус Мольвiнскiх Монiн Морадудiн Мугрузiн Марульскi Маслаў Маціяс Матьязаў Машурiк Мядзведзеў Мядянскi Мялюшкiн Мiрошнiчаў  Мiрсiянаў Мiтраковiч Міхайлаў Мiхiтарян Міхлін Мiльцын Мiцiн Можэлаў Мольвiнскiх Монiн Морадудiн Моренаў Мугрузiн Мухаматкураў Мухляаў  Муюнiн Наххомаў Нежальскi Абодкiн Агуркiс Адокi Азепаў Акавайкаў Волышаў  Алянюк Аршакаўскi Вошкаў Панiкiн Панкрушкiн Пятроў Перчукаў Пiлiнскi Пiлiщек Пiпачук Пісталенка Поладашвiлi Памяранцаў Паскакухiн Пруцян Пунтiкаў Пусташаў  Пяртель Разначынцаў Раслекаў Рахленка Рахматулін Ребекiн Рэвельскі Рэдазубаў Рашатнёў Рiмач Ройзнер Раманаў Рубель Рухавец Сагоманян Садасюк Сейсенбааў Селiончiк Селукаў Семчэнкаў Сярэбрухаў Сідараў Скалецкi Скiженюк Скрынько Слабчук Слежыкаў Смалянаў Смаргуноў Страсс Струсаў Сытяскаў Табалаў Табахьян Таболаў Тажвiцкi Таутаў Твердiслаў Тiшайкiн Ткачман Толманаў Томiнаў Тонетаў Топорнiкаў Торгоаў  Требунскiх Трiлешiнскi Анучнікаў Турзiн Туровнiк Тутараў Тутейкiн Тчаннiкаў Уалентаў Убкосмачаў  Удобнiкаў Усамедiнаў Устькачiнцаў  Ушахiн Фалушкiн Фараонаў Фарбаўскi Фарiдун Фiлатiкаў Фiмошiн Французаў Фумiч Хайтаў Ханадьян Ханыгiн Харехiн Харламавіч Хволес Хлапонін Ходоковiч Хорохорiн Хотунцаў Цебанькаў Цейнер Цепюк Чакiрiдi Чебышаў Чялакян Чынгузаў Чакашвiлi Чуграў Цудоўных Чудораў Чумiн Шабалдiн Шаблiн Шавердьян Шалёнак Шарыпаў Шiпаўскаў Шкараў  Шмыркаў Штеннiкаў Штiкаў Щепокаў Щептаў  Эдылаў Элашвiлi Этерман Эчiн Юрнаў Якiшiн Янавіч),
        female: %w(Абашнiкава Авекiрава Агапчава Агенкава Агiева Айваравa Алiмзанава Альбеева Андрэева Анiкiнiна Анiкаўская Анучкіна Арысанава Арлачава Арлушкiна Архангелава Астраханкiна Афелава Ахiлава Ачапаўская Бабайцава Бабракава Байдарава Балаганiна Балаганава Балдынава Баловiнава Балышкiна Бараноўская Баргугава Бардебанава Барьзева Батраева Бейзерава Белдзiна Беляськава Чортава Благодзiрава Блыха Блюшчыцына Бобурава Багiнiна Болсава Барадзіна Босторына Брынцалава Брыскаўская Бубiкава Бузулiцкая Букарынава Булiнава Бутонiна Буханцава Бушевская Бушкетава Валiнаўская Вахрава Вахтеева Вейдава Венiдзiктава Венскава Вергiлесава Ветрадуева Вiдзiшава Войцэхаўская Вараніхіна Варанянская Ворсобiна Вострачкава Выхадава Галачкiна Гарылева Галаванева Грабiльнiкава Грацiлева Гузаева Гулiпава Гульбiнская Дашкава Дзеваева Дубкаўская Думiнская Дурдыева Еўдашкiна Ялецкая Жалезная Жылкава Забiралава Загусцына Залозная Заломаева Замарына Занаўская Занцiнская Занючкаўская Зушчына Іванава Iголкiна Iгнатулiна Iнелеева Кавiзiна Калінаўская Калiнушкiна Каменцава Камозіна Камышкiна Карнiлiна Карпежнiкава Карагіна Кашарава Клабукава Кобзiна Ковткава  Колушкiна Комзелева Комкiна Корпушава Косарская Коцiчава Котусева Куковiцкая Кунiжева Куранчава Курнашава Курнекава Курносенкава Курсантава Кусалава Кусачава Кутубаева Кучмiнская Лазава Ланяцына Левенцава Лейзбаўская Летунава Лутавiна Лушава Лынская Мазаўская Малiсава Малiхнiкава Малкершiна Малунеева Мамушiна Манiшава Манусава Мардулатава Мацiросава Мелышкава Мiмiтаева  Мiхайлiкава Мiшалiна Марозаўская  Мышава Наганаўская Назмiева Неўская Обмiнская Ончурава Паксiватава Панiцкая Паршкiна Пастушкiна Пiгулава Пiлiпава Плуталаўская Поленцава Полонская Польская Помутава Парцянкіна Прiбытскава Пруцкава Птумкiна Пулькава Пупырнiкава Рагiцкая Радамская Рашчупкіна Руженцава Сайгашкiна Саманкiна Сергушава Сiмнава Сiнаборская Скарына Смешанава Снегава Соткiна Сумаўская Сухаручкiна Талалуева Талпыкiна Тахторава Цiханаўская Тоўсцікава Тугарынава Тулаева Турбатава Турлакава Туфанава Фаворская Фанасава Фаркава Фатнева Фiлiхiна Фогенкава Фругiна Хабайлава Халмагорава Хамбiкава Харламкiна Хвалаўская Хлямава Хрусткава Цатуравa Цымбаева Чабаева Чортава Шаніна Шановая Шаюнава Шаяхметавa Шышкава Шыянаўская Шпiкава Шувашава Шуганiкава Шумакава Шумялева Шчыконiкава Якiманская Яначкіна)
    }.freeze

    FIRST_NAMES = {
        male: %w(Абрам Аўгуст Адольф Акім Аляксандр Аляксей Альберт Альфрэд Анатоль Андрэй Антон Арыстарх Аркадзь Арнольд Арсен Арцём Арцемій Артур Аскольд Апанас Ахмет Бенядыкт Багдан Баляслаў Барыс Барыслаў Браніслаў Вадзім Валянцін Валер Васіль Венедыкт Веніямін Віктар Вільгельм Віталь Уладзімір Уладзіслаў Усевалад Вячаслаў Гаўрыіл Генадзь Генрых Георгі Герасім Герман Глеб Рыгор Давыд Данііл Дзямід Дзяніс Зміцер Яўген Еўдакім Ягор Емяльян Ермалай Яхім Жорж Захар Зіновій Ібрагім Іван Ігар Іларыён Ілля Інакенцій Іосіф Іраклій Карл Кірыл Кастусь Кузьма Лазар Лёваў Леанід Лявонцій Макар Максім Максіміліян Марат Марк Мацвей Міраслаў Міхал Мадэст Мурат Мікіта Мікалай Алег Восіп Оскар Павел Пётр Прохар Рынат Радзівон Ралан Раман Расціслаў Рудольф Руслан Рустам Сава Святаслаў Севасцьян Сямён Сяргей Спартак Станіслаў Сцяпан Тарас Цярэшка Цімафей Цімур Фёдар Фелікс Піліп Эдуард Эльдар Эмануіл Эрык Эрнэст Юльян Юры Якаў Ян Яраслаў),
        female: %w(Аўрора Агнэса Агнія Аляўціна Аляксандра Алёна Аліна Аліса Ала Альбіна Амелія Анастасся Ангеліна Анжэла Ганна Антаніна Анфіса Арына Ася Бэла Берта Барыслава Браніслава Валянціна Валерыя Ванда Варвара Васіліса Венера Вера Вераніка Вікторыя Віялета Уладзіслава Галіна Генрыэта Вяргіні Глафіра Дана Даніэла Дарына Дар'я Дыяна Дзіна Дынара Дамініка Ева Яўгенія Еўдакія Кацярына Алена Лізавета Жанна Земфіра Зінаіда Злата Зоя Ізабела Ізольда Інга Інэса Іна Іраіда Ірына Ірма Ія Каміла Карына Караліна Кіра Клаўдыя Клара Крысціна Ксенія Лада Ларыса Леся Лідзія Лілія Ліна Лія Любоў Людміла Мая Маргарыта Мар'яна Марына Марыя Марта Мар'яна Мілена Моніка Надзея Наталля Ніка Ніна Нона Аксана Алеся Вольга Паліна Радая Раіса Рэгіна Рэната Ружа Раксана Руслана Сабіна Святлана Сільва Сняжана Соф'я Станіслава Стэла Таісія Тамара Таццяна Тэрэза Ульяна Фаіна Эдзіта Эла Эльвіра Эльза Юлія Яна Яраслава)
    }.freeze

    PATRONYMICS = {
        male: %w(Абрамовіч Аўгуставіч Аўдзеевіч Адамовіч Адольфавіч Адрыянавіч Акімавіч Аляксандравіч Аляксеевіч Альбертавіч Альфрэдавіч Анатолевіч Андрэевіч Антонавіч Ануфрыевіч Арыевіч Арыстархавіч Арнольдавіч Арановіч Арсенавіч Арцёмавіч Артуравіч Аскольдавіч Бенядыктавіч Багдановіч Баляслававіч Барысавіч Барыслававіч Браніслававіч Вадзімавіч Валянцінавіч Валер'евіч Вальтэравіч Васільевіч Венедыктавіч Веніямінавіч Віктаравіч Вільгельмавіч Вісарыёнавіч Віталевіч Уладзіміравіч Уладзіслававіч Усеваладавіч Вячаслававіч Гаўрыілавіч Генадзевіч Генрыхавіч Георгіевіч Геральдавіч Герасімовіч Германавіч Глебавіч Гардзеевіч Рыгоравіч Гур'евіч Давыдавіч Даніілавіч Дземідовіч Дзям'янавіч Дзянісавіч Дзмітрыевіч Данатавіч Дарафеевіч Яўгенавіч Еўдакімавіч Яўстаф'евіч Ягоравіч Елісеевіч Емяльянавіч Ермалаевіч Ерафеевіч Яхімавіч Яфрэмавіч Захаравіч Зіноўевіч Ібрагімавіч Іванавіч Ігнатовіч Ігаравіч Ізмаілавіч Ізраілевіч Іларыёнавіч Іёнавіч Іосіфавіч Іракліевіч Ісаевіч Казіміравіч Карлавіч Кірылавіч Клаўдзевіч Клімавічаў Кандратовіч Канстанцінавіч Львовіч Левановіч Леанардавіч Леанідавіч Лявонцьевіч Любаміравіч Людвігавіч Макаравіч Максімавіч Маратавіч Маркавіч Марцінавіч Мацвеевіч Мечыслававіч Міронавіч Міраслававіч Міхайлавіч Мадэставіч Майсеевіч Назаравіч Натанавіч Навумавіч Мікітавіч Нічыпаравіч Мікалаевіч Ніканавіч Алегавіч Анісімавіч Арэставіч Восіпавіч Аскаравіч Паўлавіч Парамонавіч Пятровіч Платонавіч Прохаравіч Рашыдавіч Рычардавіч Робертавіч Радзівонавіч Раманавіч Расціслававіч Рубенавіч Рудольфавіч Русланавіч Рустамавіч Самсонавіч Святаслававіч Севасцьянавіч Сямёнавічаў Серафімавіч Сяргеевіч Саламонавіч Спартакавіч Станіслававіч Сцяпанавіч Тарасавіч Тэадоравіч Цярэшкавіч Цімафеевіч Цімуравіч Цітавіч Ціханавіч Трыфанавіч Трафімавіч Усцінавіч Фёдаравіч Феліксавіч Хвядосевіч Філімонавіч Філіповіч Фрыдрыхавіч Харытонавіч Хрысціянавіч Хрыстафоравіч Эдуардавіч Эмілевіч Эмануілавіч Эрыкавіч Эрнэставіч Юльянавіч Юр'евіч Якімовіч Янавіч Яраслававіч),
        female: %w(Абрамаўна Аўгустаўна Аўдзееўна Адамаўна Адольфаўна Адрыянаўна Акімаўна Аляксандраўна Аляксееўна Альбертаўна Альфрэдаўна Анатолеўна Андрэеўна Антонаўна Ануфрыеўна Арыстархаўна Арнольдаўна Аронаўна Арсенаўна Арцёмаўна Арцём'еўна Артураўна Аскольдаўна Апанасаўна Бенядыктаўна Багданаўна Баляславаўна Барысаўна Барыславаўна Браніславаўна Вадзімаўна Валянцінаўна Валер'еўна Вальтэраўна Васільеўна Венедыктаўна Веніямінаўна Віктараўна Вільгельмаўна Вісарыёнаўна Віталеўна Уладзіміраўна Уладзіславаўна Усеваладаўна Вячаславаўна Гаўрыілаўна Генадзеўна Генрыхаўна Георгіеўна Геральдаўна Герасімаўна Германаўна Глебаўна Гардзееўна Рыгораўна Гур'еўна Давыдаўна Даніілаўна Дзямідаўна Дзям'янаўна Дзянісаўна Дзмітрыеўна Данатаўна Дарафееўна Яўгенаўна Еўдакімаўна Яўстаф'еўна Ягораўна Елісееўна Емяльянаўна Ермалаеўна Ерафееўна Яхімаўна Яфрэмаўна Захараўна Зігмундаўна Зіноўеўна Ібрагімаўна Іванаўна Ігнатаўна Ігараўна Ізмаілаўна Ізраілеўна Іларыёнаўна Іёнаўна Іосіфаўна Іракліеўна Ісаеўна Казіміраўна Карэнаўна Карлаўна Кірылаўна Клаўдзеўна Клімаўна Кандрацьеўна Канстаўцінаўна Львоўна Леанардаўна Леанідаўна Лявонцьеўна Леапольдаўна Любаміраўна Людвігаўна Макараўна Максімаўна Маратаўна Маркаўна Марцінаўна Мацвееўна Міронаўна Міраславаўна Міхайлаўна Мадэстаўна Майсееўна Назараўна Натанаўна Навумаўна Мікітаўна Нічыпараўна Мікалаеўна Ніканаўна Алегаўна Анісімаўна Арэстаўна Восіпаўна Аскараўна Паўлаўна Парамонаўна Пятроўна Платонаўна Прохараўна Рашыдаўна Рычардаўна Робертаўна Радзівонаўна Раманаўна Расціславаўна Рудольфаўна Русланаўна Рустамаўна Самсонаўна Святаславаўна Севасцьянаўна Сямёнаўна Серафімаўна Сяргееўна Саламонаўна Спартакаўна Станіславаўна Сцяпанаўна Тарасаўна Тэадораўна Цярэшкаўна Цімафееўна Цімураўна Цітаўна Ціханаўна Трыфанаўна Трафімаўна Усцінаўна Фёдараўна Феліксаўна Хвядосаўна Філімонаўна Піліпаўна Фрыдрыхаўна Харытонаўна Хрысціянаўна Хрыстафораўна Эдуардаўна Эмілеўна Эрыкаўна Эрнэстаўна Юльянаўна Юр'еўна Янаўна Яраславаўна)
    }.freeze

    GENDER = [:male, :female].freeze

    def name
      sex = GENDER.sample
      "#{LAST_NAMES[sex].sample} #{FIRST_NAMES[sex].sample} #{PATRONYMICS[sex].sample}"
    end
  end
end
